[
    {
        "article_author": "Microsoft Threat Intelligence",
        "URL": "https://www.microsoft.com/en-us/security/blog/2024/05/28/moonstone-sleet-emerges-as-new-north-korean-threat-actor-with-new-bag-of-tricks/",
        "iocs": [
            "**Malicious Files:**",
            "",
            "1. **putty.exe (drops SplitLoader)**",
            "   - SHA-256: f59035192098e44b86c4648a0de4078edbe80352260276f4755d15d354f5fc58",
            "   - SHA-256: cb97ec024c04150ad419d1af2d1eb66b5c48ab5f345409d9d791db574981a3fb",
            "",
            "2. **[random].dat (SplitLoader)**",
            "   - SHA-256: 39d7407e76080ec5d838c8ebca5182f3ac4a5f416ff7bda9cbc4efffd78b4ff5",
            "",
            "3. **Package.db, thumbs.db (YouieLoad via npm)**",
            "   - SHA-256: 70c5b64589277ace59db86d19d846a9236214b48aacabbaf880f2b6355ab5260",
            "",
            "4. **adb.bin, u.bin, Id.bin (YouieLoad)**",
            "   - SHA-256: cafaa7bc3277711509dc0800ed53b82f645e86c195e85fbf34430bbc75c39c24",
            "",
            "5. **data.tmp (YouieLoad)**",
            "   - SHA-256: 9863173e0a45318f776e36b1a8529380362af8f3e73a2b4875e30d31ad7bd3c1",
            "",
            "6. **delfi-tank-unity.exe**",
            "   - SHA-256: f66122a3e1eaa7dcb7c13838037573dace4e5a1c474a23006417274c0c8608be",
            "",
            "7. **DeTankWar.exe**",
            "   - SHA-256: 56554117d96d12bd3504ebef2a8f28e790dd1fe583c33ad58ccbf614313ead8c",
            "   - SHA-256: ecce739b556f26de07adbfc660a958ba2dca432f70a8c4dd01466141a6551146",
            "",
            "8. **NVUnityPlugin.dll, Unityplayer.dll (YouieLoad via tank game)**",
            "   - SHA-256: 09d152aa2b6261e3b0a1d1c19fa8032f215932186829cfcca954cc5e84a6cc38",
            "",
            "**Moonstone Sleet Domains:**",
            "",
            "1. bestonlinefilmstudio[.]org",
            "2. blockchain-newtech[.]com",
            "3. ccwaterfall[.]com",
            "4. chaingrown[.]com",
            "5. defitankzone[.]com",
            "6. detankwar[.]com",
            "7. freenet-zhilly[.]org",
            "8. matrixane[.]com",
            "9. pointdnt[.]com",
            "10. starglowventures[.]com",
            "11. mingeloem[.]com"
        ],
        "ttp": [
            "Analyzing the provided indicators of compromise (IoCs) through the lens of the MITRE ATT&CK framework allows us to outline possible Tactics, Techniques, and Procedures (TTPs) that adversaries might employ. The IoCs include malicious files and domains associated with malware campaigns such as SplitLoader and YouieLoad, as well as potentially malicious software. Here's a breakdown of potential TTPs based on the provided IoCs:",
            "",
            "### Initial Access",
            "- **T1566.001 Phishing: Spearphishing Attachment**: Malicious files like `putty.exe` and game-related executables might be delivered via spearphishing emails.",
            "- **T1195.001 Supply Chain Compromise: Compromise Software Supply Chain**: The use of `Package.db` and other files indicates a potential compromise of software supply chains, particularly involving npm packages.",
            "",
            "### Execution",
            "- **T1204.002 User Execution: Malicious File**: Users might be tricked into executing malicious files such as `putty.exe` or game executables.",
            "- **T1059.007 Command and Scripting Interpreter: JavaScript**: The reference to npm suggests the use of malicious JavaScript as part of an attack.",
            "",
            "### Persistence",
            "- **T1547.001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder**: Malicious files might use registry modifications to ensure persistence.",
            "- **T1037 Logon Scripts**: Use of `data.tmp` and similar files could indicate attempts to establish persistence through logon scripts.",
            "",
            "### Defense Evasion",
            "- **T1027 Obfuscated Files or Information**: The use of `SplitLoader` and `YouieLoad` suggests obfuscation techniques to evade detection.",
            "- **T1140 Deobfuscate/Decode Files or Information**: The presence of loader malware indicates deobfuscation might be used as part of the attack chain.",
            "",
            "### Credential Access",
            "- **T1555 Credentials from Password Stores**: The use of `putty.exe` might indicate attempts to steal SSH credentials stored on the system.",
            "",
            "### Discovery",
            "- **T1083 File and Directory Discovery**: Malware like `YouieLoad` might perform reconnaissance to discover files and directories of interest on the victim's system.",
            "",
            "### Command and Control",
            "- **T1071.001 Application Layer Protocol: Web Protocols**: The listed domains could be used for C2 communications over HTTP/HTTPS.",
            "- **T1568.002 Dynamic Resolution: Domain Generation Algorithms (DGAs)**: Some of the domains might be generated dynamically to evade blocklists and maintain C2 communications.",
            "",
            "### Exfiltration",
            "- **T1041 Exfiltration Over C2 Channel**: Data might be exfiltrated over the same channels used for command and control.",
            "",
            "### Impact",
            "- **T1485 Data Destruction**: The use of malicious executables could lead to data destruction either as a primary objective or to cover tracks.",
            "",
            "### Additional Considerations",
            "- **T1583.001 Acquire Infrastructure: Domains**: The acquisition of multiple domains suggests a well-organized operation, potentially indicating a larger campaign.",
            "- **T1584.002 Compromise Infrastructure: Server**: The use of servers to host malicious files or act as C2 nodes is implied by the presence of specific domains.",
            "",
            "Given the breadth of tactics and techniques outlined, it's clear that the attackers behind these IoCs are leveraging a multi-faceted approach to compromise systems, maintain persistence, and potentially exfiltrate data or cause harm. Organizations should employ a layered defense strategy and continuously monitor for indicators of compromise to mitigate these threats."
        ],
        "summary": [
            "### Executive Summary",
            "",
            "**Event Overview:**",
            "",
            "Microsoft has identified a new North Korean threat actor named Moonstone Sleet, previously known as Storm-1789, targeting companies for financial gains and cyberespionage. Moonstone Sleet employs a blend of techniques used by other North Korean actors and unique methods, including setting up fake companies, using trojanized legitimate tools, creating a malicious game, and deploying custom ransomware.",
            "",
            "**Moonstone Sleet's Tradecraft:**",
            "",
            "- **Trojanized PuTTY:** Used for initial access, delivering custom malware loaders.",
            "- **Malicious npm packages:** Targeting potential victims via freelancing websites or platforms like LinkedIn.",
            "- **Malicious tank game (DeTankWar):** A fully functional game developed to infect devices with custom malware loaders.",
            "- **Ransomware (FakePenny):** A new custom ransomware variant aimed at financial gain.",
            "- **Fake companies:** Used to establish legitimacy and engage with potential targets.",
            "",
            "**Targets and Objectives:**",
            "",
            "Moonstone Sleet focuses on espionage and revenue generation, targeting the software and IT sectors, education, and the defense industrial base. The actor has shown interest in software companies, developers, and the aerospace sector.",
            "",
            "**Mitigation Recommendations:**",
            "",
            "1. Use Microsoft Defender XDR to detect human-operated ransomware attacks.",
            "2. Enable controlled folder access and network protection in Microsoft Defender for Endpoint.",
            "3. Harden credentials against common theft techniques.",
            "4. Run endpoint detection and response (EDR) in block mode.",
            "5. Configure investigation and remediation in full automated mode.",
            "6. Turn on cloud-delivered protection in Microsoft Defender Antivirus.",
            "",
            "**Detection and Hunting:**",
            "",
            "- Microsoft Defender Antivirus detects threat components as various malware types.",
            "- Alerts in Microsoft Defender for Endpoint can indicate Moonstone Sleet activity.",
            "- Hunting queries for Microsoft Defender XDR and Microsoft Sentinel are provided to detect related activities.",
            "",
            "**Indicators of Compromise (IoCs):**",
            "",
            "- Malicious file hashes and Moonstone Sleet domains are listed for identification and blocking purposes.",
            "",
            "**Conclusion:**",
            "",
            "Moonstone Sleet represents a well-resourced, sophisticated threat actor conducting attacks on behalf of the North Korean regime. Organizations should remain vigilant, employing recommended mitigations and continuously monitoring for IoCs to protect against these threats."
        ]
    },
    {
        "article_author": "Microsoft Threat Intelligence",
        "URL": "https://www.microsoft.com/en-us/security/blog/2024/07/02/vulnerabilities-in-panelview-plus-devices-could-lead-to-remote-code-execution/",
        "iocs": [
            "1. CVE-2023-2071 (remote code execution vulnerability in PanelView Plus)",
            "2. Denial-of-Service vulnerability in PanelView Plus",
            "3. FactoryTalk View ME v12/v13 (vulnerable versions)",
            "4. FactoryTalk® Linx v6.20/v6.30 (vulnerable versions)",
            "5. PN1645 | FactoryTalk View Machine Edition Vulnerable to Remote Code Execution (security patch)",
            "6. PN1652 | FactoryTalk® Linx Vulnerable to Denial-of-Service and Information Disclosure (security patch)",
            "7. remotehelper.dll (specific DLL file involved in exploitation)",
            "8. GetVersion (valid function name for exploitation)",
            "9. InvokeExe (function allowing execution of any executable file on the device)",
            "10. Common Industrial Protocol (CIP)",
            "11. Ethernet/IP (protocol used for communication)",
            "12. Windows 10 IoT (operating system of the device)",
            "13. Microsoft Defender for IoT (tool providing protection measures)"
        ],
        "ttp": [
            "Given the IoCs (Indicators of Compromise) listed, we can map out potential Tactics, Techniques, and Procedures (TTPs) using the MITRE ATT&CK framework. This framework categorizes various cyber attack methods into tactics (the \"why\" of an ATT&CK), techniques (the \"how\"), and procedures (the specific \"implementation\" of techniques). The IoCs presented suggest a focus on industrial control systems (ICS) and vulnerabilities within specific software and protocols. Here's an analysis based on the provided IoCs:",
            "",
            "### 1. Initial Access",
            "- **Exploit Public-Facing Application** [T1190]: Attackers could leverage vulnerabilities like CVE-2023-2071 to gain initial access through internet-facing applications such as PanelView Plus.",
            "- **Drive-by Compromise** [T1189]: If the vulnerable systems are accessible through a web browser, exploiting these vulnerabilities could also be a vector.",
            "",
            "### 2. Execution",
            "- **Exploitation for Client Execution** [T1203]: Using the remote code execution vulnerability in PanelView Plus, an attacker can run arbitrary code on the victim's system.",
            "- **Command and Scripting Interpreter** [T1059]: The InvokeExe function could be used to execute malicious scripts or commands.",
            "",
            "### 3. Persistence",
            "- **Modify Existing Software** [T1574]: An attacker could modify the remotehelper.dll or other software components to maintain persistence on the affected system.",
            "",
            "### 4. Privilege Escalation",
            "- **Exploitation for Privilege Escalation** [T1068]: Vulnerabilities like CVE-2023-2071 could also be used to gain higher privileges on the system.",
            "",
            "### 5. Defense Evasion",
            "- **Obfuscated Files or Information** [T1027]: Modifying DLLs or using legitimate function names like GetVersion for malicious purposes can help evade detection.",
            "- **Disable or Modify Tools** [T1562]: An attacker might attempt to disable Microsoft Defender for IoT or other security tools to avoid detection.",
            "",
            "### 6. Credential Access",
            "- **Exploit for Credential Access** [T1212]: Vulnerabilities could potentially be exploited to access credentials stored on the device or used by the FactoryTalk software.",
            "",
            "### 7. Discovery",
            "- **System Information Discovery** [T1082]: Functions like GetVersion might be misused to gather information about the system for further exploitation.",
            "- **Network Service Scanning** [T1046]: Using the knowledge of protocols like Ethernet/IP and CIP, attackers might scan the network to discover other vulnerable devices.",
            "",
            "### 8. Lateral Movement",
            "- **Use of Remote Services** [T1021]: Exploiting vulnerabilities in network services like FactoryTalk Linx could facilitate lateral movement within the network.",
            "",
            "### 9. Impact",
            "- **Denial of Service** [T1499]: The mentioned Denial-of-Service vulnerability in PanelView Plus could be exploited to disrupt operations, affecting availability.",
            "",
            "### 10. Collection",
            "- **Data from Information Repositories** [T1213]: Accessing information from vulnerable versions of FactoryTalk View ME or Linx could be a target for espionage or preparation for further attacks.",
            "",
            "### 11. Command and Control",
            "- **Commonly Used Port** [T1043]: Exploiting the Ethernet/IP and CIP protocols, which operate on known ports, could be used for maintaining command and control channels.",
            "",
            "### 12. Exfiltration",
            "- **Exfiltration Over C2 Channel** [T1041]: Once a command and control channel is established, it could be used to exfiltrate data.",
            "",
            "### 13. Mitigation",
            "- **Patch Management** [M1051]: Applying security patches like PN1645 and PN1652 is crucial to mitigate the vulnerabilities mentioned.",
            "",
            "This analysis is based on the provided IoCs and uses the MITRE ATT&CK framework to suggest possible TTPs an attacker might use. Actual attacks could vary based on the attacker's objectives, capabilities, and the specifics of the target environment."
        ],
        "summary": [
            "**Executive Summary: Mitigation of PanelView Plus Vulnerabilities**",
            "",
            "**Background:**",
            "Microsoft identified and disclosed two significant vulnerabilities in Rockwell Automation's PanelView Plus devices, which could allow unauthenticated attackers to perform remote code execution (RCE) and denial-of-service (DoS) attacks. These vulnerabilities, if exploited, could severely impact operations by enabling attackers to remotely execute code and disrupt services. Following the disclosure, Rockwell Automation released security patches to address these vulnerabilities.",
            "",
            "**Vulnerabilities:**",
            "1. **CVE-2023-2071**: A remote code execution vulnerability that involves the exploitation of two custom classes allowing the upload and execution of a malicious DLL.",
            "2. **Denial-of-Service Vulnerability**: Exploits the same custom class to send a crafted buffer that the device cannot handle, leading to a DoS.",
            "",
            "**Affected Versions:**",
            "- FactoryTalk View ME v12/v13",
            "- FactoryTalk® Linx v6.20/v6.30",
            "",
            "**Security Patches:**",
            "- PN1645 | FactoryTalk View Machine Edition Vulnerable to Remote Code Execution",
            "- PN1652 | FactoryTalk® Linx Vulnerable to Denial-of-Service and Information Disclosure",
            "",
            "**Key Components Involved:**",
            "- `remotehelper.dll`: A specific DLL file targeted for exploitation.",
            "- `GetVersion` and `InvokeExe`: Functions within the DLL that can be exploited for malicious purposes.",
            "- Common Industrial Protocol (CIP) and Ethernet/IP: Protocols used for communication.",
            "- Windows 10 IoT: Operating system of the affected devices.",
            "- Microsoft Defender for IoT: Provides protection measures against these vulnerabilities.",
            "",
            "**Mitigation Steps:**",
            "1. **Patch Management**: Immediately apply the provided security patches (PN1645 and PN1652) to all affected devices within your network.",
            "2. **Network Segmentation**: Ensure that critical devices are disconnected from the internet and properly segmented to limit access.",
            "3. **Access Control**: Restrict access to CIP devices to authorized components only.",
            "",
            "**Detection and Protection:**",
            "Microsoft Defender for IoT offers capabilities to detect and classify devices using CIP, raise alerts on unauthorized access or abnormal behavior, and detect attempts to exploit these vulnerabilities. It is recommended to utilize Microsoft Defender for IoT for ongoing monitoring and protection.",
            "",
            "**Conclusion:**",
            "Organizations using PanelView Plus devices are strongly advised to take immediate action to apply the security patches and follow the recommended mitigation steps to protect against potential exploitation of these vulnerabilities. Collaboration and adherence to best security practices are crucial in securing platforms and devices against such threats."
        ]
    }
]