[
    {
        "title": "Attackers exploiting new critical OpenMetadata vulnerabilities on Kubernetes clusters | Microsoft Security Blog",
        "article_author": "Microsoft Threat Intelligence",
        "URL": "https://www.microsoft.com/en-us/security/blog/2024/04/17/attackers-exploiting-new-critical-openmetadata-vulnerabilities-on-kubernetes-clusters/",
        "iocs": {
            "ip_addresses": [
                "8.222.144.60, 61.160.194.160, 8.130.115.208"
            ],
            "file_hashes": [
                "- SHA-256: 7c6f0bae1e588821bd5d66cd98f52b7005e054279748c2c851647097fa2ae2df",
                "- SHA-256: 19a63bd5d18f955c0de550f072534aa7a6a6cc6b78a24fea4cc6ce23011ea01d",
                "- SHA-256: 31cd1651752eae014c7ceaaf107f0bf8323b682ff5b24c683a683fdac7525bad"
            ],
            "domain_names": [
                "- oast.me",
                "- oast.pro",
                "- aka.ms",
                "- linkedin.com",
                "- twitter.com",
                "- thecyberwire.com"
            ],
            "email_addresses": [],
            "urls": [
                "1. https://aka.ms/threatintelblog",
                "2. https://www.linkedin.com/showcase/microsoft-threat-intelligence",
                "3. https://twitter.com/MsftSecIntel",
                "4. https://thecyberwire.com/podcasts/microsoft-threat-intelligence"
            ],
            "registry_keys": []
        },
        "ttp": {
            "Tactics": [
                "- **Resource Development (TA0042):** The presence of domain names and URLs that appear legitimate or are associated with legitimate services (like `aka.ms`, `linkedin.com`, `twitter.com`, and `thecyberwire.com`) suggests an attempt to establish infrastructure for operations, which could include phishing, C2 communications, or dissemination of malware.",
                "- **Initial Access (TA0001):** The use of IP addresses and potentially malicious URLs indicates attempts to gain entry into a network or system, possibly through direct network access or by deceiving users into interacting with malicious content.",
                "- **Command and Control (TA0011):** The listed IP addresses may serve as command and control (C2) servers, facilitating remote management of compromised systems.",
                "- **Execution (TA0002):** The presence of file hashes implies that executable content or scripts are being used, which is central to the execution phase of an attack."
            ],
            "Techniques": [
                "- **Spearphishing Link (T1566.002):** The use of legitimate-looking domain names and URLs could be part of spearphishing campaigns aimed at tricking users into clicking on malicious links.",
                "- **Drive-by Compromise (T1189):** The URLs provided may host malicious content designed to exploit vulnerabilities in a web browser, leading to the automatic download and execution of malware.",
                "- **Command and Control: Web Protocols (T1071.001):** The use of HTTP/HTTPS-based URLs for C2 communications can be inferred, as they can blend in with normal traffic and be difficult to detect.",
                "- **User Execution (T1204):** The presence of file hashes suggests that attackers are relying on users to execute the malicious files, possibly received via email or downloaded from the provided URLs."
            ],
            "Procedures": [
                "- **Domain Masquerading:** Using domains like `oast.me` and `oast.pro` that might appear benign or similar to legitimate services to host malicious content or act as C2 infrastructure.",
                "- **Distributing Malware Through Compromised Links:** Utilizing the URLs listed (e.g., `https://aka.ms/threatintelblog`) to distribute malware, either by direct downloads or by exploiting vulnerabilities in the web browser of the visitor.",
                "- **Executing Malware via SHA-256 Hashed Files:** The mentioned SHA-256 hashes represent specific malware samples. These could be used to verify the presence of these malicious files on a system, indicating a successful execution phase of an attack.",
                "- **Leveraging Social Media for Information Gathering or Phishing:** The inclusion of social media and professional network URLs (`linkedin.com`, `twitter.com`) could indicate a procedure for gathering information on potential targets or distributing phishing links through these platforms."
            ]
        }
    }
]